import gensim
import gensim.models.doc2vec
from gensim.summarization import summarize


#documents = gensim.models.doc2vec.TaggedLineDocument('result2.txt')
#loading the model
model_loaded = gensim.models.doc2vec.Doc2Vec.load('my_model_sents_from_res2.doc2vec')

#sample Text
text = '''
زبان فارسی از شاخهٔ هندواروپایی زیرشاخهٔ هندوایرانی و دستهٔ زبان‌های ایرانی است. پیشینهٔ کهن زبان فارسی به ایران باستان بازمی‌گردد. روند تاریخی زبان فارسی را به سه دوره باستان، میانی و نو بخش می‌کنند. زبان فارسی امروزی ریشه در فارسی میانه دارد و فارسی میانه ریشه در فارسی باستان.[۳۶][۳۷][۳۸][۳۹] و فارسی تنها زبان ایرانی است که هر سه دوره تاریخی آن ثبت شده و از آنها نوشتارهایی به‌جا مانده‌است.


خط پهلوی که پارسی میانه با آن نوشته می‌شد. صفحه نخست از کتاب یادگار بزرگمهر.

واژه ایرانشهر، نام رایج برای ایران در زمان ساسانیان، به خط پهلوی کتابی.
زبان فارسی به عنوان یکی از گویش‌های قوم و تیره پارس که به جنوب غربی فلات ایران کوچیده بود آغاز شد و با چیره شدن خاندان هخامنش که از این تیره بودند بر سرزمین‌های گسترده‌ای در فلات ایران و پیرامون، فارسی نیز (در شکل آن‌زمان خود یعنی پارسی باستان) زبان چیره و زبان اداری این منطقه پهناور شد. پارسی باستان مانند تمامی زبان‌های هندواروپایی آغازین زبانی بود با دستور زبان پیچیده، و دارای حالت‌های صرفی گوناگون. بسیاری از مردم غیرایرانی‌زبان منطقه وسیع شاهنشاهی هخامنشی نیز به آموختن فارسی روی آوردند و از این تماس‌ها و گسترش‌ها به عنوان یکی از دلایل روند ساده‌تر شدن دستور زبان پیچیده پارسی باستان یاد می‌کنند.[۳۲]

در اواخر دوره هخامنشی پارسی باستان با ساده‌سازی‌های پیوسته به شکل اولیه‌ای از پارسی میانه تبدیل شده‌بود. پارسی در زمان شاهنشاهی اشکانیان تأثیرات گوناگونی از زبان پارتی گرفت اما با چیرگی ساسانیان خود تبدیل به زبان برتر و زبان رسمی و اداری ایران شد و در منطقه وسیعی گسترش یافت. فارسی میانه در مناطقی چون آسیای میانه رفته‌رفته زبان رایج بازرگانان و بعدا زبان دیگر قشرها مردم شد.[۳۲]

در سده سوم پس از میلاد نوشته‌های نخستین پادشاهان ساسانی به سه زبان ضبط شده‌اند: پارتی، فارسی میانه و یونانی. پارتی زبان فرمانروایان اشکانی بود که قلمرو حکومت خود را به‌تدریج از شمال خراسان بر همه ایران گسترش دادند. فارسی میانه زبان فرمانروایان ایرانی ساسانی بود که از ایالت فارس برخاستند، بر پادشاه اشکانی چیره شدند و بر جای او در تیسفون نشستند. در این دوران پارتی در شمال و فارسی میانه در جنوب ایران زبان گفتاری بود.[۴۰]

در چهار سده فرمانروایی ساسانیان دگرگونی‌های اساسی در وضع زبان در ایران پدید آمد. پارتی دیگر به‌عنوان زبان رسمی برجای نماند و از سدهٔ چهارم به بعد همهٔ کتیبه‌ها به زبان فارسی نوشته شدند.[۴۰]

آرتور کریستنسن، ایران‌شناس نامدار دانمارکی، معتقد است که رواج زبان فارسی در مناطق شمال خاوری فلات ایران ناشی از ایجاد مراکز نظامی در خراسان، به منظور دفاع از قلمرو شاهنشاهی در برابر هجوم ساکنان آسیای میانه بود.[۴۰]

با تسخیر سرزمین باختر (بلخ) به دست ساسانیان در سال ۵۵۸ میلادی، فارسی در بلخ به عنوان زبان رسمی جانشین زبان بلخی شد و به علت این‌که دستور زبان فارسی به مراتب از بلخی ساده‌تر بود مردم این ناحیه به آسانی فارسی را پذیرفتند و این آغازی شد بر گسترش فارسی در آسیای میانه.[۳۲]

در نیمه شمالی ایران و به‌ویژه خراسان، زبان فارسی از زبان پارتی تأثیر زیادی گرفت و باعث شد تا در این ناحیه گویش تازه‌ای از فارسی (گویش شمالی آن زمان) به‌وجود بیاید که با گویش جنوبی (در پارس و خوزستان و…) تفاوت‌هایی پیدا کرد؛ با انتقال مقر شاهنشاهی ساسانیان به تیسفون و مناطق شمالی، گویش شمالی که در تیسفون رواج بیشتری یافته بود برای تمایز با گویش اصلی منطقه فارس یعنی همان گویش جنوبی، به عنوان فارسی دری (پارسی درباری) نامیده‌شد.[۳۲][۴۰]

بنابر این، در این زمان به گویش دست‌نخورده‌تر استان فارس، پارسی، و به گویش شمالی‌تر که عناصر زیادی از پارتی را در خود جذب کرده‌بود پارسی دری گفته شد. برای نمونه در حالی که در فارسی (جنوبی) واژه «گَپ» رایج بود در گویش شمالی برای همین معنی کلمه «بزرگ» به‌کار رفت.[۳۲]

در سده هفتم میلادی زبان فارسی‌زبان گفتاری نیمه جنوبی ایران، از خوزستان تا سیستان بود. در نیمه شمالی ایران فارسی‌زبان شهرها و زبان رسمی بود ولی پارتی هنوز در روستاها زبان گفتاری ساکنان بود. در بلخ نیز فارسی‌زبان رسمی نوشتاری و در حال گسترش به عنوان زبان گفتاری در جامعه بود. فارسی در این دوره در سغد و خوارزم تبدیل به زبان میانجی و بازرگانی شده‌بود.[۳۲]

بر اثر این روندها، زبان پارتی در همان دوره پیش از اسلام از خراسان بزرگ رخت بربست و جای خود را به فارسی (میانه) داد و عرب‌ها پس از حمله به ایران زبان فارسی دری را به عنوان زبان تماس با مردم محل برگزیدند و سربازان حملات اسلامی به شرق همین زبان فارسی دری را با خود در مناطق دوردست‌تری در آسیای میانه گسترش دادند.[۳۲]

 '''

print (summarize(text))
